from flask import render_template, send_from_directory
from app import app


# send asset files
@app.route('/assets/<path:type>/<path:file>')
def Asset(type, file):
    return send_from_directory('assets', f'{ type }/{ file }')


# create your views here.
@app.route('/')
def Home():
    return render_template('home.html', news=[
            {
                'pic': '1',
                'link': '1zXZb9c3kyQ',
                'name': 'ตรวจคนเข้าเมืองจังหวัดนครราชสีมา ร่วมกิจกรรมจิตอาสาพัฒนา',
                'release': '5 ธ.ค. 2564'
            },
            {
                'pic': '2',
                'link': '1zXZb9c3kyQ',
                'name': 'ตม.จว.นครราชสีมา ร่วมพิธีทำบุญตักบาตรถวายเป็นพระราชกุศล เนื่องในวันคล้ายวันพระราชสมภพ พระบาทสมเด็จพระบรมชนกาธิเบศร มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร วันชาติ และวันพ่อแห่งชาติ ๕ ธันวาคม ๒๕๖๔',
                'release': '5 ธ.ค. 2564'
            },
            {
                'pic': '3',
                'link': '1zXZb9c3kyQ',
                'name': 'ตม.จว.นครราชสีมา ประชุมบริหารราชการ ครั้งที่ 12/2564 ประจำเดือน ธันวาคม 2564',
                'release': '3 ธ.ค. 2564'
            },
            {
                'pic': '4',
                'link': '1zXZb9c3kyQ',
                'name': 'ตรวจราชการประจำปีงบประมาณ พ.ศ.2563',
                'release': '3 ก.ย. 2563'
            },
            {
                'pic': '5',
                'link': '1zXZb9c3kyQ',
                'name': 'พิธีถวายเครื่องราชสักการะและวางพานพุ่ม และพิธีจุดเทียนชัยถวายพระพรชัยมงคล 28 ก.ค.63',
                'release': '28 ก.ค. 2563'
            }
        ],
        meet=[
            {
                'pic': '1',
                'link': '1zXZb9c3kyQ',
                'name': 'ตม.จว.นครราชสีมา ร่วมประชุมคณะกรรมการโรคติดต่อจังหวัดนครราชสีมา',
                'release': '8 ธ.ค. 2564'
            },
            {
                'pic': '2',
                'link': '1zXZb9c3kyQ',
                'name': 'ประชุมบริหาร ตม.จว.นครราชสีมา',
                'release': '3 ธ.ค. 2564'
            },
            {
                'pic': '3',
                'link': '1zXZb9c3kyQ',
                'name': 'ผกก.ตม.จว.นครราชสีมา เข้าร่วมประชุมกรมการจังหวัด และหัวหน้าส่วนราชการประจำจังหวัดนครราชสีมา',
                'release': '28 มี.ค. 2562'
            },
            {
                'pic': '4',
                'link': '1zXZb9c3kyQ',
                'name': 'ตม.จว.นครราชสีมา @ เข้าร่วมประชุม กองอำนวยการรักษาความมั่นคงภายในจังหวัดนครราชสีมา',
                'release': '26 มี.ค. 2562'
            },
            {
                'pic': '5',
                'link': '1zXZb9c3kyQ',
                'name': 'ประชุมศูนย์ปราบปรามคนร้ายข้ามชาติและเข้าเมืองผิดกฎหมาย ตำรวจภูธรภาค 3',
                'release': '25 มี.ค. 2562'
            }
        ],
        crame=[
            {
                'pic': '1',
                'link': '1zXZb9c3kyQ',
                'name': 'ตม.จว.นครราชสีมา ตรวจแรงงานต่างด้าวตามมาตรการเฝ้าระวังการแพร่ระบาดของเชื้อไวรัสโควิด-19',
                'release': '12 ธ.ค. 2564'
            },
            {
                'pic': '2',
                'link': '1zXZb9c3kyQ',
                'name': 'ตม.จว.นครราชสีมา จับกุมเปรียบเทียบปรับต่างด้าวพักอาศัยไม่ตรงตามที่แจ้ง ตาม ม.37(2) และจับกุมเปรียบเทียบปรับเจ้าบ้านไม่แจ้งที่พักอาศัยให้คนต่างด้าวฯ ตาม ม.38',
                'release': '10 ธ.ค. 2564'
            },
            {
                'pic': '3',
                'link': '1zXZb9c3kyQ',
                'name': 'ตม.จว.นครราชสีมา จับกุมเปรียบเทียบปรับคนต่างด้าวพักอาศัยไม่ตรงตามที่แจ้ง ตาม ม.๓๗(๒) และจับกุมเปรียบเทียบปรับเจ้าบ้านไม่แจ้งที่พักอาศัยให้คนต่างด้าวฯ ตาม ม.๓๘',
                'release': '9 ธ.ค. 2564'
            },
            {
                'pic': '4',
                'link': '1zXZb9c3kyQ',
                'name': 'ตม.จว.นครราชสีมา ตรวจแรงงานต่างด้าวตามมาตรการเฝ้าระวัง การแพร่ระบาดของเชื้อไวรัสโควิด-19',
                'release': '8 ธ.ค. 2564'
            },
            {
                'pic': '5',
                'link': '1zXZb9c3kyQ',
                'name': 'ตม.จว.นครราชสีมา บูรณาการร่วมตรวจแรงงานต่างด้าว ตามมาตรการเฝ้าระวังการแพร่ระบาดของเชื้อไวรัสโควิด-19',
                'release': '8 ธ.ค. 2564'
            }
        ]
    )
